ezois_ka/oooezoiskaobmen/src/Catalogs/ШаблоныДокументов/ШаблоныДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныДокументов</name>
  <predefined>
    <items>
      <name>ЗапросСправки2НДФЛ</name>
      <description>Запрос справки 2-НДФЛ</description>
    </items>
    <items>
      <name>ЗапросСправкиПоОстаткамОтпуска</name>
      <description>Запрос справки по остаткам отпуска</description>
    </items>
    <items>
      <name>ЗапросСправкиСМестаРаботы</name>
      <description>Запрос справки с места работы</description>
    </items>
    <items>
      <name>ЗаявлениеНаВозвратИзОтпускаПоУходуЗаРебенком</name>
      <description>Заявление на возврат из отпуска по уходу за ребенком</description>
    </items>
    <items>
      <name>ЗаявлениеНаЕжемесячноеПособиеПоУходуЗаРебенком</name>
      <description>Заявление на ежемесячное пособие по уходу за ребенком</description>
    </items>
    <items>
      <name>ЗаявлениеНаКомпенсациюОтпуска</name>
      <description>Заявление на компенсацию отпуска</description>
    </items>
    <items>
      <name>ЗаявлениеНаНалоговыеВычеты</name>
      <description>Заявление на налоговые вычеты</description>
    </items>
    <items>
      <name>ЗаявлениеНаОтмену</name>
      <description>Заявление на отмену</description>
    </items>
    <items>
      <name>ЗаявлениеНаОтпуск</name>
      <description>Заявление на отпуск</description>
    </items>
    <items>
      <name>ЗаявлениеНаОтпускПоБеременностиИРодам</name>
      <description>Заявление на отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ЗаявлениеНаОтпускПоУходуЗаРебенком</name>
      <description>Заявление на отпуск по уходу за ребенком</description>
    </items>
    <items>
      <name>ЗаявлениеНаПереносОтпуска</name>
      <description>Заявление на перенос отпуска</description>
    </items>
    <items>
      <name>ЗаявлениеНаПособиеПриРожденииРебенка</name>
      <description>Заявление на пособие при рождении ребенка</description>
    </items>
    <items>
      <name>ЗаявлениеНаУдержаниеДСВ</name>
      <description>Заявление на удержание ДСВ</description>
    </items>
    <items>
      <name>ЗаявлениеНаУчебныйОтпуск</name>
      <description>Заявление на учебный отпуск</description>
    </items>
    <items>
      <name>ЗаявлениеОбИзмененииЛичныхДанных</name>
      <description>Заявление об изменении личных данных</description>
    </items>
    <items>
      <name>Отсутствие</name>
      <description>Отсутствие</description>
    </items>
  </predefined>
  <attributes>
    <name>МакетДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПодписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяНаличиеВложений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДОБЗК</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Настройки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/Catalogs/ШаблоныДокументов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ФормаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьУсловноеОформление();
	УстановитьОтображениеСписка(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ТекущаяВерсияDTO = Неопределено;
	Для Каждого Строка Из Строки Цикл
		Если Строка.Значение.Данные.Предопределенный Тогда
			Если ТекущаяВерсияDTO = Неопределено Тогда
				ТекущаяВерсияDTO = Справочники.ШаблоныДокументов.ПорядокВерсии(
					Справочники.ШаблоныДокументов.ТекущаяВерсияШаблонов());
			КонецЕсли;
			ТекущаяВерсия = Справочники.ШаблоныДокументов.ПорядокВерсии(Строка.Значение.Данные.Версия);
			ВерсииШаблона = Справочники.ШаблоныДокументов.ПредопределенныеВерсииШаблонов(Строка.Значение.Данные.ИмяПредопределенныхДанных);
			Для Каждого СтрокаВерсии Из ВерсииШаблона Цикл
				Если ТекущаяВерсия < СтрокаВерсии.ПорядокВерсий
					И СтрокаВерсии.ПорядокВерсий <= ТекущаяВерсияDTO Тогда
					
					Строка.Значение.Данные.НоваяВерсия = Истина;
					Прервать;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьШаблоныВАрхиве(Команда)
	
	Элементы.ФормаПоказыватьШаблоныВАрхиве.Пометка =
		Не Элементы.ФормаПоказыватьШаблоныВАрхиве.Пометка;
	
	УстановитьОтображениеСписка(ЭтотОбъект);
	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеСписка(УправляемаяФорма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		УправляемаяФорма.Список, "ВАрхиве", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Не УправляемаяФорма.Элементы.ФормаПоказыватьШаблоныВАрхиве.Пометка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ТекущийШрифт = Элементы.Список.Шрифт;
	ЗачеркнутыйШрифт = Новый Шрифт(ТекущийШрифт,,,,,,Истина,);
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru='Зачеркивать не используемые шаблоны.'");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ВАрхиве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт",ЗачеркнутыйШрифт);
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Список");
	
КонецПроцедуры

#КонецОбласти
